// 使用：在一行代码中指定对象的多个属性时必须使用分号分隔，但如果一行只指定一个属性类型就不需要分号分隔。
const person1: { 
  // 问号表示可选参数
  name?: string
  age: number
  greet(name: string): void
 } = {
  name: "peiqi",
  age: 18,
  greet(name) {
    console.log("你好", name);
  },
};

// .......................................................................................

// readonly只读属性：可以用于{}的对象、接口、类
let obj: { readonly name: string } = {
  name: "peiqi",
};
// obj.name = 'cat'   // 只读属性，无法赋值

// .......................................................................................

export {};
