// 作用一：获取数据的类型
console.log(typeof 'hello world')

// ---------------------------------------------------------------------------------------------

// 作用二：获取已有变量的类型，简化类型书写
let p = {x:'peiqi', y:18}

// function Info(info:{x:string, y:number}){
//   console.log(info)
// }

function Info(info:typeof p){
  console.log(info)
}
// 以上两种形式等同
Info(p)

// ---------------------------------------------------------------------------------------------

// 注意：typeof只能用来查询变量或属性的类型，无法查询其它形式的类型（如函数调用的类型）
let res1 : typeof p.x

// let res2 : typeof Info(p)    // 报错

// ---------------------------------------------------------------------------------------------

export {}